class Team {
  String? currentTeam = 'A조';
  late Map teamScheduleInfo;

  List teamASchdule = [
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ],
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ],
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ]
  ];

  List teamBSchdule = [
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ],
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ],
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ]
  ];

  List teamCSchdule = [
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ],
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ],
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ]
  ];

  List teamDSchdule = [
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ],
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ],
    [
      '학교집결',
      '학교출발',
      '탑승수속',
      '김포-제주',
      '중식-이레한정식',
      '새별오름',
      '오설록',
      '세리카트-미로공원 탐방',
      '저녁 식사-소인쿡',
      '숙소 도착',
      '학급활동/일상점검'
    ]
  ];

  Team() {
    teamScheduleInfo = {
      'A조': teamASchdule,
      'B조': teamBSchdule,
      'C조': teamCSchdule,
      'D조': teamDSchdule,
    };
  }
}
